<a href="https://colab.research.google.com/github/itzelduranv/Optativa7Semestre/blob/main/Uniones.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Tipos de Uniones**

In [1]:
import pandas as pd

In [5]:
df1 = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Nombre': ['Ana', 'Juan', 'María', 'Carlos'],
    'Departamento': ['Ventas', 'IT', 'Marketing', 'RH']
})

df2 = pd.DataFrame({
    'ID': [3, 4, 5, 6],
    'Salario': [50000, 60000, 55000, 65000],
})

print(df1)
print(df2)

   ID  Nombre Departamento
0   1     Ana       Ventas
1   2    Juan           IT
2   3   María    Marketing
3   4  Carlos           RH
   ID  Salario
0   3    50000
1   4    60000
2   5    55000
3   6    65000

## Fusión inner

In [6]:
inner_merge = pd.merge(df1, df2, on='ID', how='inner')
print('\nFusión inner')
print(inner_merge)

Fusión inner
   ID  Nombre Departamento  Salario
0   3   María    Marketing    50000
1   4  Carlos           RH    60000

## Fusión outer

In [7]:
outer_merge = pd.merge(df1, df2, on='ID', how='outer')
print('\nFusión outer')
print(outer_merge)

Fusión outer
   ID  Nombre Departamento  Salario
0   1     Ana       Ventas      NaN
1   2    Juan           IT      NaN
2   3   María    Marketing  50000.0
3   4  Carlos           RH  60000.0
4   5     NaN          NaN  55000.0
5   6     NaN          NaN  65000.0

## Fusión left

In [8]:
left_merge = pd.merge(df1, df2, on='ID', how='left')
print('\nFusión left')
print(left_merge)

Fusión left
   ID  Nombre Departamento  Salario
0   1     Ana       Ventas      NaN
1   2    Juan           IT      NaN
2   3   María    Marketing  50000.0
3   4  Carlos           RH  60000.0

## Fusión right

In [9]:
right_merge = pd.merge(df1, df2, on='ID', how='right')
print('\nFusión right')
print(right_merge)

Fusión right
   ID  Nombre Departamento  Salario
0   3   María    Marketing    50000
1   4  Carlos           RH    60000
2   5     NaN          NaN    55000
3   6     NaN          NaN    65000

## Concatenación

In [11]:
#Concatenación
df3 = pd.DataFrame({
    'ID': [7,8],
    'Nombre': ['Sofia', 'Pedro'],
    'Departamento': ['Finanzas', 'Ventas']
})

concatenated = pd.concat([df1, df3], ignore_index=True)
print('\nConcatenación')
print(concatenated)

concatenated2 = pd.concat([df1, df2], ignore_index=True)
print('\nConcatenación 2')
print(concatenated2)

Concatenación
   ID  Nombre Departamento
0   1     Ana       Ventas
1   2    Juan           IT
2   3   María    Marketing
3   4  Carlos           RH
4   7   Sofia     Finanzas
5   8   Pedro       Ventas

Concatenación 2
   ID  Nombre Departamento  Salario
0   1     Ana       Ventas      NaN
1   2    Juan           IT      NaN
2   3   María    Marketing      NaN
3   4  Carlos           RH      NaN
4   3     NaN          NaN  50000.0
5   4     NaN          NaN  60000.0
6   5     NaN          NaN  55000.0
7   6     NaN          NaN  65000.0